[Killed] ObjectLiteral
main/components/TabComponent/StaffTabComponent.jsx:27:5
   const { data: courseStaff } = useBackend(
     [`/api/coursestaff/course?courseId=${courseId}`],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
-    { method: "GET", url: `/api/coursestaff/course?courseId=${courseId}` },
+    {},
     [],
     true,
killedBy: StaffTabComponent Tests StaffTabComponent Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] ObjectLiteral
main/components/TabComponent/StaffTabComponent.jsx:36:13
   const objectToAxiosParamsPost = (staff) => ({
     url: `/api/coursestaff/post`,
     method: "POST",
-    params: {
-      courseId: courseId,
-      firstName: staff.firstName,
-      lastName: staff.lastName,
-      email: staff.email,
-    },
+    params: {},
   });
 
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected {} to deeply equal { courseId: 7, …(3) }

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:160:25
           })}
           currentUser={currentUser}
           courseId={courseId}
-          testIdPrefix={`${testIdPrefix}-CourseStaffTable`}
+          testIdPrefix={``}
         />
       </Row>
killedBy: StaffTabComponent Tests StaffTabComponent Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >
