[Timeout] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:7:14
 
 export function CourseWarningBanner({ courseId, orgName }) {
   const [isBasePermissionWarningHidden, setIsBasePermissionWarningHidden] =
-    useState(false);
+    useState(true);
   const { data: warnings } = useBackend(
     [`/api/courses/warnings/${courseId}`],

[Timeout] ArrowFunction
main/components/Courses/CourseWarningBanner.jsx:25:5
     },
   );
   const hideWarningMutation = useBackendMutation(
-    () => ({
-      method: "POST",
-      url: `/api/courses/warnings/hideBasePermissionWarning/${courseId}`,
-    }),
+    () => undefined,
     {
       onSuccess: () => setIsBasePermissionWarningHidden(true),

[Timeout] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:30:57
       url: `/api/courses/warnings/hideBasePermissionWarning/${courseId}`,
     }),
     {
-      onSuccess: () => setIsBasePermissionWarningHidden(true),
+      onSuccess: () => setIsBasePermissionWarningHidden(false),
     },
   );

[Timeout] ArrowFunction
main/components/Courses/CourseWarningBanner.jsx:30:18
       url: `/api/courses/warnings/hideBasePermissionWarning/${courseId}`,
     }),
     {
-      onSuccess: () => setIsBasePermissionWarningHidden(true),
+      onSuccess: () => undefined,
     },
   );

[Timeout] BlockStatement
main/components/Courses/CourseWarningBanner.jsx:34:19
     },
   );
 
-  useEffect(() => {
-    setIsBasePermissionWarningHidden(false);
-  }, [courseId]);
+  useEffect(() => {}, [courseId]);
 
   const shouldShowBasePermissionWarning =

[Timeout] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:35:38
   );
 
   useEffect(() => {
-    setIsBasePermissionWarningHidden(false);
+    setIsBasePermissionWarningHidden(true);
   }, [courseId]);
 

[Killed] OptionalChaining
main/components/Courses/CourseWarningBanner.jsx:39:5
   }, [courseId]);
 
   const shouldShowBasePermissionWarning =
-    warnings?.showDefaultBasePermissions && !isBasePermissionWarningHidden;
+    warnings.showDefaultBasePermissions && !isBasePermissionWarningHidden;
 
   return (
killedBy: InstructorCourseShowPage tests Cleans up correctly on unmount
statusReason: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Timeout] LogicalOperator
main/components/Courses/CourseWarningBanner.jsx:39:5
   }, [courseId]);
 
   const shouldShowBasePermissionWarning =
-    warnings?.showDefaultBasePermissions && !isBasePermissionWarningHidden;
+    warnings?.showDefaultBasePermissions || !isBasePermissionWarningHidden;
 
   return (

[Killed] StringLiteral
main/components/Courses/CourseWarningBanner.jsx:56:21
           organization may be able to access other students&apos; private repos.{" "}
           {orgName ? (
             <Alert.Link
-              href={`https://github.com/organizations/${orgName}/settings/member_privileges`}
+              href={``}
               target="_blank"
               rel="noopener noreferrer"
killedBy: CourseWarningBanner tests renders default base permission warning with link and hides after post
statusReason: Unable to find an accessible element with the role "link" and name `/You can change that setting here/i`

Here are the accessible roles:

  alert:

  Name "":
  <div

[Timeout] ArrowFunction
main/components/Courses/CourseWarningBanner.jsx:70:24
             <Button
               variant="outline-dark"
               size="sm"
-              onClick={() => hideWarningMutation.mutate()}
+              onClick={() => undefined}
               disabled={hideWarningMutation.isPending}
             >
