[Killed] StringLiteral
main/components/Assignments/DeleteReposForm.jsx:20:24
           type="text"
           isInvalid={Boolean(errors.prefix)}
           data-testid="DeleteReposForm-prefix"
-          {...register("prefix", {
+          {...register("", {
             required: "Repository Prefix is required.",
           })}
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Assignments/DeleteReposForm.jsx:21:23
           isInvalid={Boolean(errors.prefix)}
           data-testid="DeleteReposForm-prefix"
           {...register("prefix", {
-            required: "Repository Prefix is required.",
+            required: "",
           })}
         />
killedBy: DeleteReposForm tests requires repo prefix
statusReason: Unable to find an element with the text: Repository Prefix is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="DeleteReposForm"

[Killed] OptionalChaining
main/components/Assignments/DeleteReposForm.jsx:25:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.prefix?.message}
+          {errors.prefix.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of undefined (reading 'message')
