[Killed] ObjectLiteral
main/components/Courses/CoursesTable.jsx:9:3
     header: "id",
     accessorKey: "id", // accessor is the "key" in the data
   },
-  {
-    header: "Course Name",
-    accessorKey: "courseName",
-  },
+  {},
   {
     header: "Term",
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element with the text: Join Course. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:66:22
           break;
       }
       return (
-        <Tooltip id={`${studentStatus.toLowerCase()}-tooltip`} {...props}>
+        <Tooltip id={``} {...props}>
           {set_message}
         </Tooltip>
killedBy: CoursesTable tests expect the correct tooltip ID
statusReason: expect(element).toHaveAttribute("id", "member-tooltip") // element.getAttribute("id") === "member-tooltip"

Expected the element to have attribute:
  id="member-tooltip"
Received:
  id=""

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:76:20
     ...columns,
     {
       header: "Status",
-      accessorKey: "studentStatus",
+      accessorKey: "",
       cell: ({ cell }) => {
         const status = cell.row.original.studentStatus;
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Columns require an id when using a non-string header

[Killed] EqualityOperator
main/components/Courses/CoursesTable.jsx:79:13
       accessorKey: "studentStatus",
       cell: ({ cell }) => {
         const status = cell.row.original.studentStatus;
-        if (status === "PENDING") {
+        if (status !== "PENDING") {
           return (
             <OverlayTrigger
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Pending
Received:
  PENDING

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:119:42
               </span>
             </OverlayTrigger>
           );
-        } else if (status === "INVITED") {
-          return (
-            <OverlayTrigger
-              placement="right"
-              overlay={renderTooltip("INVITED")}
-            >
-              <span>
-                <Button
-                  variant={"primary"}
-                  onClick={() => viewInviteCallback(cell)}
-                  data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-                >
-                  View Invite
-                </Button>
-              </span>
-            </OverlayTrigger>
-          );
-        } else if (status === "OWNER") {
+        } else if (status === "INVITED") {} else if (status === "OWNER") {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
killedBy: CoursesTable tests Does not call joinCallback in default case for button'View Invite'
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-2-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"
