[Killed] BlockStatement
main/components/TabComponent/AssignmentTabComponent.jsx:13:41
     toast("Repository creation successfully started.");
   };
 
-  const onSuccessTeamAssignment = () => {
-    toast("Team repository creation successfully started.");
-  };
+  const onSuccessTeamAssignment = () => {};
 
   const onSuccessDeleteRepos = () => {
killedBy: Calls team repository assignment successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Team repository creation successfully started.",

[Killed] StringLiteral
main/components/TabComponent/AssignmentTabComponent.jsx:14:11
   };
 
   const onSuccessTeamAssignment = () => {
-    toast("Team repository creation successfully started.");
+    toast("");
   };
 
killedBy: Calls team repository assignment successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Team repository creation successfully started.",

[Killed] BlockStatement
main/components/TabComponent/AssignmentTabComponent.jsx:17:38
     toast("Team repository creation successfully started.");
   };
 
-  const onSuccessDeleteRepos = () => {
-    toast("Delete repositories job successfully started.");
-  };
+  const onSuccessDeleteRepos = () => {};
 
   const objectToAxiosParamsIndividualAssignment = (assignment) => ({
killedBy: Calls delete repos job successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete repositories job successfully started.",

[Killed] ArrowFunction
main/components/TabComponent/AssignmentTabComponent.jsx:21:51
     toast("Delete repositories job successfully started.");
   };
 
-  const objectToAxiosParamsIndividualAssignment = (assignment) => ({
-    url: `/api/repos/createRepos`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      repoPrefix: assignment.repoPrefix,
-      isPrivate: assignment.assignmentPrivacy,
-      permissions: assignment.permissions,
-      creationOption: assignment.creationOption,
-    },
-  });
+  const objectToAxiosParamsIndividualAssignment = () => undefined;
 
   const indvidiualAssignmentMutation = useBackendMutation(
killedBy: Calls individual repository assignment successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Repository creation successfully started.",

[Killed] ArrowFunction
main/components/TabComponent/AssignmentTabComponent.jsx:42:45
     indvidiualAssignmentMutation.mutate(assignment);
   };
 
-  const objectToAxiosParamsTeamAssignment = (teamAssignment) => ({
-    url: `/api/repos/createTeamRepos`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      repoPrefix: teamAssignment.repoPrefix,
-      isPrivate: teamAssignment.assignmentPrivacy,
-      permissions: teamAssignment.permissions,
-    },
-  });
+  const objectToAxiosParamsTeamAssignment = () => undefined;
 
   const teamAssignmentMutation = useBackendMutation(
killedBy: Calls team repository assignment successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Team repository creation successfully started.",

[Killed] StringLiteral
main/components/TabComponent/AssignmentTabComponent.jsx:43:10
   };
 
   const objectToAxiosParamsTeamAssignment = (teamAssignment) => ({
-    url: `/api/repos/createTeamRepos`,
+    url: ``,
     method: "POST",
     params: {
killedBy: Calls team repository assignment successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Team repository creation successfully started.",

[Killed] BlockStatement
main/components/TabComponent/AssignmentTabComponent.jsx:58:50
     { onSuccess: onSuccessTeamAssignment },
   );
 
-  const postTeamAssignment = (teamAssignment) => {
-    teamAssignmentMutation.mutate(teamAssignment);
-  };
+  const postTeamAssignment = (teamAssignment) => {};
 
   const objectToAxiosParamsDeleteRepos = (deleteReposRequest) => ({
killedBy: Calls team repository assignment successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Team repository creation successfully started.",

[Killed] ArrowFunction
main/components/TabComponent/AssignmentTabComponent.jsx:62:42
     teamAssignmentMutation.mutate(teamAssignment);
   };
 
-  const objectToAxiosParamsDeleteRepos = (deleteReposRequest) => ({
-    url: `/api/repos`,
-    method: "DELETE",
-    params: {
-      courseId: courseId,
-      prefix: deleteReposRequest.prefix,
-    },
-  });
+  const objectToAxiosParamsDeleteRepos = () => undefined;
 
   const deleteReposMutation = useBackendMutation(
killedBy: Calls delete repos job successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete repositories job successfully started.",

[Killed] ObjectLiteral
main/components/TabComponent/AssignmentTabComponent.jsx:62:67
     teamAssignmentMutation.mutate(teamAssignment);
   };
 
-  const objectToAxiosParamsDeleteRepos = (deleteReposRequest) => ({
-    url: `/api/repos`,
-    method: "DELETE",
-    params: {
-      courseId: courseId,
-      prefix: deleteReposRequest.prefix,
-    },
-  });
+  const objectToAxiosParamsDeleteRepos = (deleteReposRequest) => ({});
 
   const deleteReposMutation = useBackendMutation(
killedBy: Calls delete repos job successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete repositories job successfully started.",

[Killed] ObjectLiteral
main/components/TabComponent/AssignmentTabComponent.jsx:73:5
 
   const deleteReposMutation = useBackendMutation(
     objectToAxiosParamsDeleteRepos,
-    {
-      onSuccess: onSuccessDeleteRepos,
-    },
+    {},
   );
 
killedBy: Calls delete repos job successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete repositories job successfully started.",

[Killed] BlockStatement
main/components/TabComponent/AssignmentTabComponent.jsx:78:51
     },
   );
 
-  const postDeleteRepos = (deleteReposRequest) => {
-    deleteReposMutation.mutate(deleteReposRequest);
-  };
+  const postDeleteRepos = (deleteReposRequest) => {};
 
   return (
killedBy: Calls delete repos job successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete repositories job successfully started.",

[Killed] StringLiteral
main/components/TabComponent/AssignmentTabComponent.jsx:83:51
   };
 
   return (
-    <Row md={3} className="g-2 mb-2" data-testid={"AssignmentTabComponent"}>
+    <Row md={3} className="g-2 mb-2" data-testid={""}>
       <Col md={6}>
         <Card className="h-100">
killedBy: InstructorCourseShowPage tests Tab Components are Present
statusReason: Unable to find an element by: [data-testid="AssignmentTabComponent"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
