[Killed] OptionalChaining
main/components/TabComponent/StaffTabComponent.jsx:155:15
             if (staffMember.email.toLowerCase().includes(searchTermLower)) {
               return true;
             } else if (
-              staffMember.githubLogin?.toLowerCase().includes(searchTermLower)
+              staffMember.githubLogin.toLowerCase().includes(searchTermLower)
             ) {
               return true;
killedBy: StaffTabComponent Tests Search filter works correctly First Name, Email
statusReason: Cannot read properties of null (reading 'toLowerCase')
