[Killed] ObjectLiteral
src/main/pages/HomePageLoggedIn.jsx:115:22
             />
             <Button
               onClick={createCourse}
-              style={{ float: "right", marginBottom: 10 }}
+              style={{}}
               variant="primary"
             >
killedBy: HomePageLoggedIn tests Can submit new course
statusReason: expect(element).toHaveStyle()

- Expected

- float: right;
- margin-bottom: 10px;

[Killed] LogicalOperator
src/main/pages/HomePageLoggedIn.jsx:126:14
                 No instructor courses yet. Click the button above to create one.
               </p>
             )}
-            {instructorCourses.length > 0 && (
-              <>
-                <>
-                  <InstructorCoursesTable
-                    courses={instructorCourses}
-                    currentUser={currentUser}
-                  />
-                </>
-              </>
-            )}
+            {instructorCourses.length > 0 || <>
+                <>
+                  <InstructorCoursesTable courses={instructorCourses} currentUser={currentUser} />
+                </>
+              </>}
           </>
         )}
killedBy: HomePageLoggedIn tests tables render correctly for instructor when courses exist
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.jsx:140:10
         )}
         <h1>Your Student Courses</h1>
         <StudentCoursesTable testid={"CoursesTable"} />
-        {staffCourses.length > 0 && (
-          <>
-            <h1>Your Staff Courses</h1>
-            <CoursesTable
-              courses={staffCourses}
-              testId={"StaffCoursesTable"}
-              joinCallback={joinStaffCourseCallback}
-              isLoading={isStaffJoining}
-              courseShowRoutePrefix="/staff/courses"
-            />
-          </>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-1-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
