[Killed] StringLiteral
main/pages/Staff/StaffCourseShowPage.jsx:43:18
     if (getCourseFailed) {
       setShowErrorModal(true);
       const timer = setTimeout(() => {
-        navigate("/", { replace: true });
+        navigate("", { replace: true });
       }, 3000);
       // Stryker disable next-line BlockStatement
killedBy: StaffCourseShowPage tests returns to home page when course lookup fails
statusReason: expected "vi.fn()" to be called with arguments: [ '/', { replace: true } ]

Received:

  1st vi.fn() call:

  [
-   "/",

[Survived] StringLiteral
main/pages/Staff/StaffCourseShowPage.jsx:144:24
             currentUser={currentUser}
           />
         </Tab>
-        <Tab eventKey={"staff"} title={"Staff"} className="pt-2">
+        <Tab eventKey={""} title={"Staff"} className="pt-2">
           <StaffTabComponent
             courseId={courseId}

[Killed] BooleanLiteral
main/pages/Staff/StaffCourseShowPage.jsx:149:27
             courseId={courseId}
             testIdPrefix={testId}
             currentUser={currentUser}
-            isInstructor={false}
+            isInstructor={true}
           />
         </Tab>
killedBy: StaffCourseShowPage tests does not allow staff users to add, edit, or delete staff
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="w-100 btn btn-primary"
  data-testid="StaffCourseShowPage-post-button"
  type="button"
>
  Add Staff Member

[Killed] StringLiteral
main/pages/Staff/StaffCourseShowPage.jsx:159:42
             currentUser={currentUser}
           />
         </Tab>
-        <Tab eventKey={"default"} title={"Assignments"} className="pt-2">
+        <Tab eventKey={"default"} title={""} className="pt-2">
           <AssignmentTabComponent
             courseId={courseId}
killedBy: StaffCourseShowPage tests renders course details with staff tabs and hides settings
statusReason: Unable to find an accessible element with the role "tab" and name "Assignments"

Here are the accessible roles:

  navigation:

  Name "":
  <nav
