[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:13:25
   {
     header: "Course Name",
     id: "courseName",
-    cell: ({ cell }) => {
-      if (!courseShowRoutePrefix) {
-        return cell.row.original.courseName;
-      }
-      return (
-        <OverlayTrigger
-          placement="right"
-          overlay={
-            <Tooltip id={`tooltip-coursename-${cell.row.index}`}>
-              View course details
-            </Tooltip>
-          }
-        >
-          <Link
-            to={`${courseShowRoutePrefix}/${cell.row.original.id}`}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-          >
-            {cell.row.original.courseName}
-          </Link>
-        </OverlayTrigger>
-      );
-    },
+    cell: ({ cell }) => {},
   },
   {
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 156
Received:

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:14:11
     header: "Course Name",
     id: "courseName",
     cell: ({ cell }) => {
-      if (!courseShowRoutePrefix) {
+      if (true) {
         return cell.row.original.courseName;
       }
killedBy: CoursesTable tests renders course names as links when route prefix is provided
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] BooleanLiteral
main/components/Courses/CoursesTable.jsx:14:11
     header: "Course Name",
     id: "courseName",
     cell: ({ cell }) => {
-      if (!courseShowRoutePrefix) {
+      if (courseShowRoutePrefix) {
         return cell.row.original.courseName;
       }
killedBy: CoursesTable tests renders course names as links when route prefix is provided
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:27:17
           }
         >
           <Link
-            to={`${courseShowRoutePrefix}/${cell.row.original.id}`}
+            to={``}
             data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
           >
killedBy: CoursesTable tests renders course names as links when route prefix is provided
statusReason: expect(element).toHaveAttribute("href", "/staff/courses/1") // element.getAttribute("href") === "/staff/courses/1"

Expected the element to have attribute:
  href="/staff/courses/1"
Received:
  href="/"

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:54:40
   isLoading,
   courseShowRoutePrefix,
 }) {
-  const viewInviteCallback = (cell) => {
-    const organizationName = cell.row.original.orgName;
-    const gitInvite = `https://github.com/orgs/${organizationName}/invitation`;
-    window.open(gitInvite, "_blank");
-  };
+  const viewInviteCallback = (cell) => {};
 
   const renderTooltip = (studentStatus) =>
killedBy: CoursesTable tests Does not call joinCallback when storybook is explicitly false for button 'View Invite'
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:56:23
 }) {
   const viewInviteCallback = (cell) => {
     const organizationName = cell.row.original.orgName;
-    const gitInvite = `https://github.com/orgs/${organizationName}/invitation`;
+    const gitInvite = ``;
     window.open(gitInvite, "_blank");
   };
killedBy: CoursesTable tests Does not call joinCallback when storybook is explicitly false for button 'View Invite'
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "https://github.com/orgs/ucsb-cs156-f25/invitation",

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:57:28
   const viewInviteCallback = (cell) => {
     const organizationName = cell.row.original.orgName;
     const gitInvite = `https://github.com/orgs/${organizationName}/invitation`;
-    window.open(gitInvite, "_blank");
+    window.open(gitInvite, "");
   };
 
killedBy: CoursesTable tests Does not call joinCallback when storybook is explicitly false for button 'View Invite'
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "https://github.com/orgs/ucsb-cs156-f25/invitation",

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:65:14
       let set_message;
 
       switch (studentStatus) {
-        case "PENDING":
+        case "":
           set_message =
             "This course has not been completely set up by your instructor yet.";
killedBy: CoursesTable tests tooltips for PENDING status
statusReason: Unable to find an element with the text: This course has not been completely set up by your instructor yet.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:117:38
           return (
             <OverlayTrigger
               placement="right"
-              overlay={renderTooltip("JOINCOURSE")}
+              overlay={renderTooltip("")}
             >
               <span>
killedBy: CoursesTable tests tooltips for JOINCOURSE status
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:166:20
               <span className="text-info">Owner</span>
             </OverlayTrigger>
           );
-        } else if (status === "MEMBER") {
+        } else if (false) {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"
