[Killed] ObjectLiteral
main/components/Courses/CoursesTable.jsx:16:5
       header: "id",
       accessorKey: "id", // accessor is the "key" in the data
     },
-    {
-      header: "Course Name",
-      id: "courseName",
-      cell: ({ cell }) => {
-        return (
-          <Link
-            to={`/student/courses/${cell.row.original.id}`}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-courseName-link`}
-          >
-            {cell.row.original.courseName}
-          </Link>
-        );
-      },
-    },
+    {},
     {
       header: "Term",
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element with the text: Join Course. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:19:27
     {
       header: "Course Name",
       id: "courseName",
-      cell: ({ cell }) => {
-        return (
-          <Link
-            to={`/student/courses/${cell.row.original.id}`}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-courseName-link`}
-          >
-            {cell.row.original.courseName}
-          </Link>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 156
Received:

[Survived] StringLiteral
main/components/Courses/CoursesTable.jsx:22:17
       cell: ({ cell }) => {
         return (
           <Link
-            to={`/student/courses/${cell.row.original.id}`}
+            to={``}
             data-testid={`${testId}-cell-row-${cell.row.index}-col-courseName-link`}
           >
