[Killed] BlockStatement
main/components/Nav/AppNavbar.jsx:16:30
 }) {
   const navigation = useNavigate();
   const location = useLocation();
-  const handleSignIn = () => {
-    sessionStorage.setItem("redirect", location.pathname);
-    navigation("/login");
-  };
+  const handleSignIn = () => {};
   return (
     <>
killedBy: AppNavbar tests onclick navigates to login
statusReason: expected "vi.fn()" to be called with arguments: [ '/login' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Nav/AppNavbar.jsx:17:28
   const navigation = useNavigate();
   const location = useLocation();
   const handleSignIn = () => {
-    sessionStorage.setItem("redirect", location.pathname);
+    sessionStorage.setItem("", location.pathname);
     navigation("/login");
   };
killedBy: AppNavbar tests onclick navigates to login
statusReason: expected null to be '/example/return' // Object.is equality

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:22:8
   };
   return (
     <>
-      {(currentUrl.startsWith("http://localhost:3000") ||
-        currentUrl.startsWith("http://127.0.0.1:3000")) && (
-        <AppNavbarLocalhost url={currentUrl} />
-      )}
+      {false}
       <Navbar
         expand="md"
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-md navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:46:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {systemInfo?.showSwaggerUILink && (
-                <>
-                  <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
-                </>
-              )}
+              {systemInfo?.showSwaggerUILink || <>
+                  <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
+                </>}
               {systemInfo?.springH2ConsoleEnabled && (
                 <>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] OptionalChaining
main/components/Nav/AppNavbar.jsx:46:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {systemInfo?.showSwaggerUILink && (
+              {systemInfo.showSwaggerUILink && (
                 <>
                   <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Cannot read properties of undefined (reading 'showSwaggerUILink')

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:51:16
                   <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
                 </>
               )}
-              {systemInfo?.springH2ConsoleEnabled && (
-                <>
-                  <Nav.Link href="/h2-console">H2Console</Nav.Link>
-                </>
-              )}
+              {systemInfo?.springH2ConsoleEnabled || <>
+                  <Nav.Link href="/h2-console">H2Console</Nav.Link>
+                </>}
               {hasRole(currentUser, "ROLE_ADMIN") && (
                 <NavDropdown
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:51:16
                   <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
                 </>
               )}
-              {systemInfo?.springH2ConsoleEnabled && (
-                <>
-                  <Nav.Link href="/h2-console">H2Console</Nav.Link>
-                </>
-              )}
+              {false}
               {hasRole(currentUser, "ROLE_ADMIN") && (
                 <NavDropdown
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:56:16
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
                 </>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/users">
-                    Users
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/admins">
-                    Admins
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/instructors">
-                    Instructors
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/courses">
-                    Courses
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/jobs">
-                    Jobs
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
             </Nav>
             {hasRole(currentUser, "ROLE_GITHUB") && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:56:16
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
                 </>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/users">
-                    Users
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/admins">
-                    Admins
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/instructors">
-                    Instructors
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/courses">
-                    Courses
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/jobs">
-                    Jobs
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
             </Nav>
             {hasRole(currentUser, "ROLE_GITHUB") && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:80:14
                 </NavDropdown>
               )}
             </Nav>
-            {hasRole(currentUser, "ROLE_GITHUB") && (
-              <Nav className="ml-auto">
-                <GithubLogin
-                  currentUser={currentUser}
-                  systemInfo={systemInfo}
-                />
-              </Nav>
-            )}
+            {true}
             <Nav className="ml-auto">
               <GoogleLogin
killedBy: AppNavbar tests If user does have ROLE_GITHUB, it does renders the connected to github
statusReason: Unable to find an element with the text: Github: cgaucho-github. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-md navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:80:14
                 </NavDropdown>
               )}
             </Nav>
-            {hasRole(currentUser, "ROLE_GITHUB") && (
-              <Nav className="ml-auto">
-                <GithubLogin
-                  currentUser={currentUser}
-                  systemInfo={systemInfo}
-                />
-              </Nav>
-            )}
+            {false}
             <Nav className="ml-auto">
               <GoogleLogin
killedBy: AppNavbar tests If user does have ROLE_GITHUB, it does renders the connected to github
statusReason: Unable to find an element with the text: Github: cgaucho-github. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-md navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
