[Killed] ArrowFunction
main/pages/Student/StudentCourseShowPage.jsx:46:44
   const testId = "StudentCourseShowPage";
   return (
     <BasicLayout>
-      <Modal show={showErrorModal} onHide={() => setShowErrorModal(false)}>
+      <Modal show={showErrorModal} onHide={() => undefined}>
         <Modal.Header closeButton>
           <Modal.Title>Course Not Found</Modal.Title>
killedBy: StudentCourseShowPage tests Modal can be closed by clicking the header close button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] BooleanLiteral
main/pages/Student/StudentCourseShowPage.jsx:46:68
   const testId = "StudentCourseShowPage";
   return (
     <BasicLayout>
-      <Modal show={showErrorModal} onHide={() => setShowErrorModal(false)}>
+      <Modal show={showErrorModal} onHide={() => setShowErrorModal(true)}>
         <Modal.Header closeButton>
           <Modal.Title>Course Not Found</Modal.Title>
killedBy: StudentCourseShowPage tests Modal can be closed by clicking the header close button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] ConditionalExpression
main/pages/Student/StudentCourseShowPage.jsx:86:16
                   {course.term}
                 </span>
               </div>
-              {course.orgName && (
-                <div className="d-flex align-items-center gap-2">
-                  <a
-                    href={`https://github.com/${course.orgName}`}
-                    target="_blank"
-                    rel="noopener noreferrer"
-                    className="text-primary text-decoration-none fs-5"
-                    data-testid={`${testId}-github-org-link`}
-                  >
-                    {course.orgName}
-                  </a>
-                </div>
-              )}
+              {false}
             </div>
           </div>
killedBy: StudentCourseShowPage tests renders correctly for a student user
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
main/pages/Student/StudentCourseShowPage.jsx:86:16
                   {course.term}
                 </span>
               </div>
-              {course.orgName && (
-                <div className="d-flex align-items-center gap-2">
-                  <a
-                    href={`https://github.com/${course.orgName}`}
-                    target="_blank"
-                    rel="noopener noreferrer"
-                    className="text-primary text-decoration-none fs-5"
-                    data-testid={`${testId}-github-org-link`}
-                  >
-                    {course.orgName}
-                  </a>
-                </div>
-              )}
+              {true}
             </div>
           </div>
killedBy: StudentCourseShowPage tests renders correctly for a student user
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null
