[Killed] ArrayDeclaration
main/components/TabComponent/EnrollmentTabComponent.jsx:36:5
     [`/api/rosterstudents/course/${courseId}`],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/rosterstudents/course/${courseId}` },
-    [],
+    ["Stryker was here"],
     true,
   );
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:91:44
     {
       onSuccess: () => onSuccessRoster(setCsvModal),
       onError: (error) => {
-        if (error.response.status !== 409) {
-          toast.error(
-            `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
-          );
-        } else {
+        if (error.response.status !== 409) {} else {
           setCsvErrorModal(true);
           setCsvErrorModalData(error.response.data.rejected);
killedBy: EnrollmentTabComponent Tests CsvForm error returns correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:114:30
   };
 
   const openCsvHelp = () => {
-    window.open("/help/csv", "_blank");
+    window.open("/help/csv", "");
   };
 
killedBy: EnrollmentTabComponent Tests Info icon displays tooltip and opens help page on click
statusReason: expected "vi.fn()" to be called with arguments: [ '/help/csv', '_blank' ]

Received:

  1st vi.fn() call:

  [
    "/help/csv",

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:123:22
         show={csvErrorModal}
         onHide={() => setCsvErrorModal(false)}
         centered={true}
-        data-testid={`${testIdPrefix}-csv-error-modal`}
+        data-testid={``}
         size="lg"
       >
killedBy: EnrollmentTabComponent Tests CsvForm rejected shows modal
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-error-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:186:26
                   top: "50%",
                   right: "0.75rem",
                   transform: "translateY(-50%)",
-                  color: "#fff",
+                  color: "",
                   cursor: "pointer",
                   fontSize: "0.9rem",
killedBy: EnrollmentTabComponent Tests Info icon displays tooltip and opens help page on click
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:187:27
                   right: "0.75rem",
                   transform: "translateY(-50%)",
                   color: "#fff",
-                  cursor: "pointer",
+                  cursor: "",
                   fontSize: "0.9rem",
                   userSelect: "none",
killedBy: EnrollmentTabComponent Tests Info icon displays tooltip and opens help page on click
statusReason: expect(element).toHaveStyle()

- Expected

- cursor: pointer;

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:188:29
                   transform: "translateY(-50%)",
                   color: "#fff",
                   cursor: "pointer",
-                  fontSize: "0.9rem",
+                  fontSize: "",
                   userSelect: "none",
                 }}
killedBy: EnrollmentTabComponent Tests Info icon displays tooltip and opens help page on click
statusReason: expect(element).toHaveStyle()

- Expected

- fontSize: 0.9rem;

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:221:30
                 placeholder="Search by name, email, student ID, or Github Login"
                 value={searchTerm}
                 onChange={(e) => setSearchTerm(e.target.value)}
-                data-testid={`${testIdPrefix}-search`}
+                data-testid={``}
               />
             </Col>
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-search"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:258:26
         <h2>Dropped Students</h2>
         <DroppedStudentsTable
           students={rosterStudents.filter(
-            (student) => student.rosterStatus === "DROPPED",
+            (student) => false,
           )}
           courseId={courseId}
killedBy: EnrollmentTabComponent Tests Dropped Students appear correctly
statusReason: Unable to find an element by: [data-testid="DroppedStudentsTable-cell-row-0-col-studentId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >
