[Killed] BlockStatement
main/components/TabComponent/DownloadStudentCSVButton.jsx:4:64
 import React from "react";
 import { Button } from "react-bootstrap";
 
-export default function DownloadStudentCSVButton({ courseId }) {
-  const downloadCsv = () => {
-    window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
-  };
-
-  return (
-    <Button onClick={downloadCsv} className="w-100">
-      Download Student CSV
-    </Button>
-  );
-}
+export default function DownloadStudentCSVButton({ courseId }) {}
 
killedBy: EnrollmentTabComponent Tests Modals close on close buttons (respectively), download works
statusReason: Unable to find an element with the text: Download Student CSV. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/TabComponent/DownloadStudentCSVButton.jsx:5:29
 import { Button } from "react-bootstrap";
 
 export default function DownloadStudentCSVButton({ courseId }) {
-  const downloadCsv = () => {
-    window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
-  };
+  const downloadCsv = () => {};
 
   return (
killedBy: EnrollmentTabComponent Tests Modals close on close buttons (respectively), download works
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""
