[Killed] BlockStatement
main/components/TabComponent/DownloadsTabComponent.jsx:5:75
 import { Col, Row } from "react-bootstrap";
 import DownloadStudentCSVButton from "main/components/TabComponent/DownloadStudentCSVButton";
 
-export default function DownloadsTabComponent({ courseId, testIdPrefix }) {
-  return (
-    <div data-testid={`${testIdPrefix}-DownloadsTabComponent`}>
-      <Row sm={3} className="p-2">
-        <Col>
-          <DownloadStudentCSVButton courseId={courseId} />
-        </Col>
-      </Row>
-    </div>
-  );
-}
+export default function DownloadsTabComponent({ courseId, testIdPrefix }) {}
 
killedBy: InstructorCourseShowPage tests Tab Components are Present
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-DownloadsTabComponent"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
