[Killed] BooleanLiteral
main/components/TabComponent/StaffTabComponent.jsx:22:18
   courseId,
   testIdPrefix,
   currentUser,
-  isInstructor = true,
+  isInstructor = false,
 }) {
   const [postModal, showPostModal] = useState(false);
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:32:48
     [],
     true,
   );
-  const [searchTerm, setSearchTerm] = useState("");
+  const [searchTerm, setSearchTerm] = useState("Stryker was here!");
 
   const objectToAxiosParamsPost = (staff) => ({
killedBy: StaffTabComponent Tests StaffTabComponent Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:71:8
 
   return (
     <div data-testid={`${testIdPrefix}-StaffTabComponent`}>
-      {isInstructor && (
-        <Modal
-          show={postModal}
-          onHide={() => showPostModal(false)}
-          centered={true}
-          data-testid={`${testIdPrefix}-post-modal`}
-        >
-          <ModalHeader closeButton>Add Staff Member</ModalHeader>
-          <ModalBody>
-            <CourseStaffForm
-              submitAction={handlePostSubmit}
-              cancelDisabled={true}
-            />
-          </ModalBody>
-        </Modal>
-      )}
+      {true}
       <Row sm={3} className="p-2">
         <Col>
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: Unable to find a label with the text of: First Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] LogicalOperator
main/components/TabComponent/StaffTabComponent.jsx:71:8
 
   return (
     <div data-testid={`${testIdPrefix}-StaffTabComponent`}>
-      {isInstructor && (
-        <Modal
-          show={postModal}
-          onHide={() => showPostModal(false)}
-          centered={true}
-          data-testid={`${testIdPrefix}-post-modal`}
-        >
-          <ModalHeader closeButton>Add Staff Member</ModalHeader>
-          <ModalBody>
-            <CourseStaffForm
-              submitAction={handlePostSubmit}
-              cancelDisabled={true}
-            />
-          </ModalBody>
-        </Modal>
-      )}
+      {isInstructor || <Modal show={postModal} onHide={() => showPostModal(false)} centered={true} data-testid={`${testIdPrefix}-post-modal`}>
+          <ModalHeader closeButton>Add Staff Member</ModalHeader>
+          <ModalBody>
+            <CourseStaffForm submitAction={handlePostSubmit} cancelDisabled={true} />
+          </ModalBody>
+        </Modal>}
       <Row sm={3} className="p-2">
         <Col>
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: Unable to find a label with the text of: First Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:92:30
           <OverlayTrigger placement="top" overlay={renderComingSoonTooltip}>
             <span className="d-inline-block w-100">
               <Button
-                data-testid={`${testIdPrefix}-csv-button`}
+                data-testid={``}
                 className="w-100 button btn-secondary disabled"
                 disabled
killedBy: StaffTabComponent Tests for coming soon tooltip on disabled upload CSV button
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:103:10
             </span>
           </OverlayTrigger>
         </Col>
-        {isInstructor && (
-          <Col>
-            <Button
-              onClick={() => showPostModal(true)}
-              data-testid={`${testIdPrefix}-post-button`}
-              className="w-100"
-            >
-              Add Staff Member
-            </Button>
-          </Col>
-        )}
+        {true}
         <Col>
           <Button
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] LogicalOperator
main/components/TabComponent/StaffTabComponent.jsx:103:10
             </span>
           </OverlayTrigger>
         </Col>
-        {isInstructor && (
-          <Col>
-            <Button
-              onClick={() => showPostModal(true)}
-              data-testid={`${testIdPrefix}-post-button`}
-              className="w-100"
-            >
-              Add Staff Member
-            </Button>
-          </Col>
-        )}
+        {isInstructor || <Col>
+            <Button onClick={() => showPostModal(true)} data-testid={`${testIdPrefix}-post-button`} className="w-100">
+              Add Staff Member
+            </Button>
+          </Col>}
         <Col>
           <Button
killedBy: StaffTabComponent Tests hides add staff member controls when user is not an instructor
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="w-100 btn btn-primary"
  data-testid="StaffCourseShowPage-post-button"
  type="button"
>
  Add Staff Member

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:116:22
         )}
         <Col>
           <Button
-            onClick={() =>
-              window.open(`/api/csv/coursestaff?courseId=${courseId}`, "_blank")
+            onClick={() => undefined
             }
             data-testid={`${testIdPrefix}-download-csv-button`}
killedBy: StaffTabComponent Tests clicking download CSV button calls window.open with correct url
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:119:26
             onClick={() =>
               window.open(`/api/csv/coursestaff?courseId=${courseId}`, "_blank")
             }
-            data-testid={`${testIdPrefix}-download-csv-button`}
+            data-testid={``}
             className="w-100 button btn-secondary"
           >
killedBy: StaffTabComponent Tests clicking download CSV button calls window.open with correct url
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-download-csv-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] MethodExpression
main/components/TabComponent/StaffTabComponent.jsx:149:17
           staff={courseStaff.filter((staffMember) => {
             const searchTermLower = searchTerm.toLowerCase();
             const fullName = `${staffMember.firstName} ${staffMember.lastName}`;
-            if (staffMember.email.toLowerCase().includes(searchTermLower)) {
+            if (staffMember.email.toUpperCase().includes(searchTermLower)) {
               return true;
             } else if (
killedBy: StaffTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:149:17
           staff={courseStaff.filter((staffMember) => {
             const searchTermLower = searchTerm.toLowerCase();
             const fullName = `${staffMember.firstName} ${staffMember.lastName}`;
-            if (staffMember.email.toLowerCase().includes(searchTermLower)) {
+            if (false) {
               return true;
             } else if (
killedBy: StaffTabComponent Tests Search filter works correctly First Name, Email
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-CourseStaffTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
