[Killed] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:72:8
 
   return (
     <div data-testid={`${testIdPrefix}-StaffTabComponent`}>
-      {isInstructor && (
-        <Modal
-          show={postModal}
-          onHide={() => showPostModal(false)}
-          centered={true}
-          data-testid={`${testIdPrefix}-post-modal`}
-        >
-          <ModalHeader closeButton>Add Staff Member</ModalHeader>
-          <ModalBody>
-            <CourseStaffForm
-              submitAction={handlePostSubmit}
-              cancelDisabled={true}
-            />
-          </ModalBody>
-        </Modal>
-      )}
+      {false}
       <Row sm={3} className="p-2">
         <Col>
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: Unable to find a label with the text of: First Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:104:10
             </span>
           </OverlayTrigger>
         </Col>
-        {isInstructor && (
-          <Col>
-            <Button
-              onClick={() => showPostModal(true)}
-              data-testid={`${testIdPrefix}-post-button`}
-              className="w-100"
-            >
-              Add Staff Member
-            </Button>
-          </Col>
-        )}
+        {false}
         <Col>
           <div className="d-flex align-items-center position-relative">
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:118:24
         <Col>
           <div className="d-flex align-items-center position-relative">
             <Button
-              onClick={() =>
-                window.open(
-                  `/api/csv/coursestaff?courseId=${courseId}`,
-                  "_blank",
-                )
+              onClick={() => undefined
               }
               data-testid={`${testIdPrefix}-download-csv-button`}
killedBy: StaffTabComponent Tests clicking download CSV button calls window.open with correct url
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:138:26
               }
             >
               <BsInfoCircle
-                onClick={() =>
-                  window.open("/help/csv#staff-information", "_blank")
+                onClick={() => undefined
                 }
                 // Stryker disable all
killedBy: StaffTabComponent Tests clicking csv info icon opens help page
statusReason: expected "vi.fn()" to be called with arguments: [ '/help/csv#staff-information', …(1) ]

Number of calls: 0

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:139:62
             >
               <BsInfoCircle
                 onClick={() =>
-                  window.open("/help/csv#staff-information", "_blank")
+                  window.open("/help/csv#staff-information", "")
                 }
                 // Stryker disable all
killedBy: StaffTabComponent Tests clicking csv info icon opens help page
statusReason: expected "vi.fn()" to be called with arguments: [ '/help/csv#staff-information', …(1) ]

Received:

  1st vi.fn() call:

  [
    "/help/csv#staff-information",

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:153:30
                   userSelect: "none",
                 }}
                 // Stryker restore all
-                data-testid={`${testIdPrefix}-csv-info-icon`}
+                data-testid={``}
               />
             </OverlayTrigger>
killedBy: StaffTabComponent Tests clicking csv info icon opens help page
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-info-icon"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
