[Killed] StringLiteral
main/pages/Help/HelpCsvPage.jsx:251:31
                 You can upload staff using a CSV with the following required
                 columns:
               </p>
-              <pre className={"csvExample"} data-testid="staffCsvExample">
+              <pre className={""} data-testid="staffCsvExample">
                 {csvFixtures.staffUpload}
               </pre>
killedBy: HelpCsvPage tests renders with separate Team Information section and examples
statusReason: expect(element).toHaveClass("csvExample")

Expected the element to have class:
  csvExample
Received:
